.config/polybar/config
; [[file:../../Desktop.org::*Colors][Colors:1]]
[colors]
; Palenight colorscheme https://github.com/JonathanSpeek/palenight-iterm2
black = ${xrdb:color0}
red = ${xrdb:color1}
green = ${xrdb:color2}
yellow = ${xrdb:color3}
blue = ${xrdb:color4}
magenta = ${xrdb:color5}
cyan = ${xrdb:color6}
white = ${xrdb:color7}

black-lighter = ${xrdb:color8}
red-lighter = ${xrdb:color9}
green-lighter = ${xrdb:color10}
yellow-lighter = ${xrdb:color11}
blue-lighter = ${xrdb:color12}
magenta-lighter = ${xrdb:color13}
cyan-lighter = ${xrdb:color14}
white-lighter = ${xrdb:color15}

background = ${xrdb:background}
foreground = ${xrdb:foreground}
; Colors:1 ends here

; [[file:../../Desktop.org::*Bar config][Bar config:1]]
[bar/mybar]
monitor = ${env:MONITOR:}
width = 100%
height = ${env:HEIGHT:27}
offset-x = 0
offset-y = 0
radius = 0.0
fixed-center = false
bottom=true

background = ${colors.background}
foreground = ${colors.foreground}

line-size = 3
line-color = #f00

padding-left = 0
padding-right = 0

module-margin-left = 1
module-margin-right = 1

font-0 = ${env:FONT0:pango:monospace:size=10;1}
font-1 = ${env:FONT1:NotoEmoji:scale=10:antialias=false;0}
font-2 = ${env:FONT2:fontawesome:pixelsize=10;1}
font-3 = ${env:FONT3:JetBrains Mono Nerd Font:monospace:size=10;1}

modules-left = i3
; modules-center = test
modules-right = ${env:RIGHT_BLOCKS}

tray-position = ${env:TRAY:right}
tray-padding = 0
tray-maxsize = 16
;tray-background = #0063ff

wm-restack = i3
; override-redirect = true

scroll-up = i3wm-wsnext
scroll-down = i3wm-wsprev

; cursor-click = pointer
; cursor-scroll = ns-resize

[settings]
screenchange-reload = true
;compositing-background = xor
;compositing-background = screen
;compositing-foreground = source
;compositing-border = over
;pseudo-transparency = false

[global/wm]
margin-top = 0
margin-bottom = 0
; Bar config:1 ends here
